/*
 * 	1. 난수 저장할 배열
 * 	2. while문
 * 		① 중복안되면 트루, 중복되면 false
 * 		② 배열에 난수 저장
 *  	③ 조건문 (중복안되면 불린 트루, 난수저장)
 *  			(중복되면 불른 펄스, 난수 다시 생성)
 */
import java.util.*;
public class 연습2 {

	public static void main(String[] args) {
		// 난수를 저장할 배열
		int[] arr = new int[10];
		// 임시저장할 변수
		int random = 0;
		
		
		// for문 루프(중복이면true 중복아니면 false로 루프 나오기)
		boolean check = false;
// =====================================================================================	i는 0부터 배열크기까지 반복
		for(int i = 0; i < arr.length; i++) {
			check = true;
// ===========================================================			check가 true일 때 난수 주입하고 false로 종료
			while(check) {
				random = (int)(Math.random()*10)+1;
				check = false;
		// ============================================		j가 0부터 i까지 반복하여 비교
				for(int j = 0; j < i; j++) {
				//=============================		난수와 배열인덱스값이 일치할 때 
					if(arr[j] == random) {			// true로 변환하여 while문 실행
						check = true;
						
					}
				//=============================	
				}
		// ============================================		
			}
// ============================================================
			arr[i] = random;
		}
// ======================================================================================
		for(int i : arr) {
			System.out.print(i + " ");
		}
		
	

	}
}

