
public class MainClass1 {
	public static void main(String[] args) {
		/*
		 * 정수
		 *  10진법
		 *  8진법 (0 ~~)
		 *  16진법 (0x ~~)
		 *  2진법 (0b ~~)
		 *  
		 * 실수 
		 *  저장크기
		 *   4바이트(소수점 이하 8자리까지) 10.5f
		 *   8바이트(소수점 이하 16자리까지) 10.5
		 * 
		 * 문자
		 *  한 글자만 저장 ('')
		 *  
		 * 문자열
		 *  여러 글자 저장 ("")
		 *  
		 * 1. 기본 문법
		 *     - 대소문자 구분 (클래스: 대소문자, 메소드: 소문자, 상수: 모두 대문자)
		 *     - 변수: int kor = 100;
		 *     - 상수: final int kor = 200;
		 *     - 명령문 종료 시 반드시 ; 사용
		 * 
		 * 2. 들여쓰기
		 */
		int a = 1;
		int b = 10;
		System.out.println(a + b);
		
	}
}
