
public class 반복문_for5 {

	public static void main(String[] args) {
//		 // 짝수의 합
		
//		int sum1 = 0;
//		for(int i = 0; i <= 100; i += 2) {
//			sum1 = sum1 + i;
//		}
//		System.out.printf("1부터 100까지 짝수의 합 : %d\n", sum1);
//
//		// 홀수의 합
//		
//		int sum2 = 0;
//		for(int i = 1; i <= 100; i += 2) {
//			sum2 = sum2 + i;
//		}
//		System.out.printf("1부터 100까지 홀수의 합 : %d\n", sum2);
		
		
		
		
		
// ☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★ for문 따로 쓰지 말고 조건문과 함께 쓸 것 ☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★
// ↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓
		
		int j = 0, h = 0;
		
		for(int i = 1; i <= 100; i++) {
			if (i % 2 == 0) {
				j = j + i;
			}
			else {
				h = h + i;
			}
		}
		System.out.printf("1부터 100까지 짝수의 합 : %d\n", j);
		System.out.printf("1부터 100까지 홀수의 합 : %d\n", h);
		
// ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑	
// ☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★ for문 따로 쓰지 말고 조건문과 함께 쓸 것 ☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★

		
		
		
		
		
		
		
// ☆★☆★☆★☆★☆★☆★ 3, 5, 7의 배수는 중복되는게 있으므로 else if가 아니라 if문을 여러개 써야 모두 누적됨 ☆★☆★☆★☆★☆★☆★
// ↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓

		int three = 0, five = 0, seven = 0;
		
		for(int i = 1; i <= 100; i++) {
			if (i % 3 == 0) {
				three = three + i;
			}
			if (i % 5 == 0) {
				five = five + i;
			}
			if (i % 7 == 0) {
				seven = seven + i;
			}
		}
		System.out.printf("1부터 100까지 3의 배수의 합 : %d\n", three);
		System.out.printf("1부터 100까지 5의 배수의 합 : %d\n", five);
		System.out.printf("1부터 100까지 7의 배수의 합 : %d\n", seven);
		
// ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑	
// ☆★☆★☆★☆★☆★☆★ 3, 5, 7의 배수는 중복되는게 있으므로 else if가 아니라 if문을 여러개 써야 모두 누적됨 ☆★☆★☆★☆★☆★☆★
		
		
		
		
		
		
		// 100~999까지 7의 배수의 갯수
		
		int count = 0;
		
		for(int i = 100; i <= 999; i++) {
			if(i % 7 == 0) {
				count++;
			}
		}
		System.out.println("100~999까지 7의 배수의 갯수 : " + count);
		
		
		
		
		
		
		// 1-2+3-4+5-6+7-8+9-10
		
		int plus = 0;
		for(int i = 1; i <= 10; i++) {
			if(i % 2 == 0) {
				plus = plus - i;
			}
			else {
				plus = plus + i;
			}
		}
		System.out.println("1-2+3-4+5-6+7-8+9-10 : " + plus);

	}

}
