/*
 * 	◆ 연산자 특징
 * 
 * 		1. 자동 형변환 (같은 타입으로 변환)
 * 			int + long  =>  long + long
 * 			double + int  =>  double + double
 * 		2. 강제 형변환 (작은 타입으로 변환)
 * 		3. int 이하의 연산자들은 자동으로 int로 변환되어 연산됨
 * 		4. / : 0으로 나눌 수 없음
 * 		     	 정수 / 정수 = 정수(소수점 버림) 
 * 	   	   % : 결과값 부호는 왼쪽 항의 부호를 따름
 * 		
 * 	◆ 단항 연산자
 * 		1. ++, -- : 전위형 (먼저 증감하고 다른 문장 수행)
 * 					후위형 (다른 문장 수행 후 증감)
 * 		2. ! : boolean만 사용 가능
 * 		3. (type) : 강제 형변환
 * 					(int)10.5  =>  10
 * 					(char)65  =>  'A'
 * 
 * 	◆ 이항 연산자
 * 		1. 산술 연산자 : 통계, 급여계산, 인사고과, 입출금
 * 		2. 비교 연산자
 * 		3. 논리 연산자 : 예매, 예약, 경매
 * 		4. 대입 연산자
 */

public class 연산자정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
