/*
 * 	◆ 2차원 배열
 * 		1. 형식
 * 			① 데이터형[][] 배열명; <============ 권장
 * 			② 데이터형 배열명 [][];
 * 			③ 데이터형[] 배열명[]
 * 		2. 초기화
 * 			int[][] arr = {{1, 2, 3}, {4, 5, 6}, {7, 8, 9}}; <============== 3행 3열
 * 				
 * 				================================
 * 					1			2			3
 * 				arr[0][0]	arr[0][1]	arr[0][2]
 * 				================================
 * 					4			5			6
 * 				arr[1][0]	arr[1][1]	arr[1][2]
 * 				================================
 * 					7			8			9
 * 				arr[2][0]	arr[2][1]	arr[2][2]
 * 				================================
 */
public class 이차원배열1 {

	public static void main(String[] args) {
		// 1~25
		int[][] arr = new int[5][5];
		
		// 초기값
		int k = 1;
		// 행
		for(int i = 0; i < 5; i++) {
		// 열
			for(int j = 0; j < 5; j++) {
				arr[i][j] = k;
				k++;
			}
		}
		
		for(int i = 0; i < 5; i++) {
			for(int j = 0; j < 5; j++) {
				System.out.printf("arr[%d][%d] = %d\t", i, j, arr[i][j]);
			}
			System.out.println();
		}
	}

}
