/*
 *  ==============================================
 * 						1		
 * 	==============================================
 * 				2		3		4		
 * 	==============================================
 * 		5		6		7		8		9								
 * 	==============================================
 * 				10		11		12		
 * 	==============================================
 * 						13
 * 	==============================================
 */
public class 이차원배열3 {

	public static void main(String[] args) {
		// 5행 5열의 배열
		int[][] arr = new int[5][5];
		
		
		// for문 1		
		int k = 1;
		for(int i = 0; i <= 2; i++) {
			for(int j = 2-i; j <= i+2; j++) {
				arr[i][j] = k;
				k++;
			}
		}
		
		
		// for문 2
		for(int i = 3; i <= 4; i++) {
			for(int j = i-2; j <= 6-i; j++) {
				arr[i][j] = k;
				k++;
			}
		}
		
		
		// 출력
		for(int i = 0; i < 5; i++) {
			for(int j = 0; j < 5; j++) {
				if(arr[i][j] == 0) {
					System.out.print("\t");
				}
				else {
					System.out.print(arr[i][j] + "\t");
				}
				
					
			}
			System.out.println("\n");
				
		}
		
		

	}

}
